In [2]:
import csv
import re

##This function is used to correct the error in the titles of books
def format_headers(header:str) -> str:
    return header.lower().replace("-","_") if header.upper() != "ISBN" else header
def read_csv(filename:str):
    # Open the CSV file using a context manager.
    with open(filename, mode='r', newline='',encoding='latin-1') as csv_file:
    # Create a CSV reader object.
        csv_reader = csv.reader(csv_file,delimiter=";")
        headers = next(csv_reader)  # Lee los encabezados, si es necesario.
        rows = list(csv_reader)  # Lee todas las filas.
    return headers, rows
headers,csv_reader = read_csv("raw/books_data/books.csv")

In [7]:
import pandas as pd
books = pd.read_csv("raw/books_data/books.csv",delimiter=";",encoding="latin-1",on_bad_lines='skip',nrows=100)
ratings = pd.read_csv("raw/books_data/ratings.csv",delimiter=";",encoding="latin-1",on_bad_lines='skip',nrows=100)
users = pd.read_csv("raw/books_data/users.csv",delimiter=";",encoding="latin-1",on_bad_lines='skip')

In [4]:
print(ratings.info())
print(books.info())
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   User-ID      100 non-null    int64
 1   ISBN         100 non-null    object
 2   Book-Rating  100 non-null    int64
dtypes: int64(2), object(1)
memory usage: 2.5+ KB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ISBN                 100 non-null    object
 1   Book-Title           100 non-null    object
 2   Book-Author          100 non-null    object
 3   Year-Of-Publication  100 non-null    int64
 4   Publisher            100 non-null    object
 5   Image-URL-S          100 non-null    object
 6   Image-URL-M          100 non-null    object
 7   Image-URL-L          100 non-null    object
dtypes: int64(1), object(7)
memory usage: 6.4+ KB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   User-ID   100 non-null    int64
 1   Location  100 non-null    object
 2   Age       54 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.5+ KB

In [8]:
users.tail(2)

        User-ID                   Location  Age
278856   278857  knoxville, tennessee, usa  NaN
278857   278858       dublin, n/a, ireland  NaN

In [6]:
#Just to keep the columns names consistent with SQL good practices.
books.columns = list(map(lambda x:x.lower(),books.columns))
print(f"We have {books.shape[0]} rows in this dataset")
books.head()

We have 100 rows in this dataset

,isbn,book-title,book-author,year-of-publication,publisher,image-url-s,image-url-m,image-url-l
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

## Author db

In [59]:
#Extract the author name into a series 
author_df = pd.DataFrame()
author_df["author"] = rd["author"].unique()
print(f"We have {author_df.shape[0]} authors in this dataset")
author_df[["last_name","name"]] = author_df["author"].str.split(", ",expand=True)
author_df["id_author"] = author_df.index
author_tosql = author_df.drop(columns="author")

author_tosql.head(1)

We have 130 authors in this dataset

  last_name     name  id_author
0   Goswami  Jaideva          0

In [60]:
#Generate and id column for the author
author_tosql["id_author"] = author_tosql.index
print(author_tosql.tail(4))

    last_name     name  id_author
126   Rowling      J K        126
127   Larsson    Steig        127
128    Eddins    Steve        128
129   Dickens  Charles        129

### Connect to SQL and charge the values to the database

In [61]:
#host='localhost', user='root',password='micolash12',database="bookstore"
from sqlalchemy import create_engine
#Create the database connection
engine = create_engine('mysql+pymysql://root:micolash12@localhost/bookstore')
#Use the built-in function 'to_sql' to write the dataframe to the database
author_tosql.to_sql('author', engine, if_exists='replace', index = False)

130

## Books db

In [62]:
#Copy the df to a book related to preserve the original
book_df = rd.copy()
#Add the id_author foreign key to the book
#replace all the occurences of the author for the value in the author dataframe
book_df['id_author'] = book_df['author'].map(author_df.set_index('author')['id_author'])

                      title            author              genre  height  \
0  Fundamentals of Wavelets  Goswami, Jaideva  signal_processing     228
1                Data Smart     Foreman, John       data_science     235

  publisher
0     Wiley
1     Wiley

,title,author,genre,height,publisher,id_author
0,Fundamentals of Wavelets,"Goswami, Jaideva",signal_processing,228,Wiley,0
1,Data Smart,"Foreman, John",data_science,235,Wiley,1

In [63]:
#Now drop the author dataframe for avoiding to much information
book_df = book_df.drop(columns=["author"])
book_df

,title,genre,height,publisher,id_author
0,Fundamentals of Wavelets,signal_processing,228,Wiley,0
1,Data Smart,data_science,235,Wiley,1
2,God Created the Integers,mathematics,197,Penguin,2
3,Superfreakonomics,economics,179,HarperCollins,3
4,Orientalism,history,197,Penguin,4
...,...,...,...,...,...
206,Structure and Randomness,mathematics,252,NaN,21
207,Image Processing with MATLAB,signal_processing,241,NaN,128
208,Animal Farm,fiction,180,NaN,80
209,"Idiot, The",fiction,197,NaN,58
210,"Christmas Carol, A",fiction,196,NaN,129

In [64]:
#host='localhost', user='root',password='micolash12',database="bookstore"
from sqlalchemy import create_engine
#Create the database connection
engine = create_engine('mysql+pymysql://root:micolash12@localhost/bookstore')
#Use the built-in function 'to_sql' to write the dataframe to the database
book_df.to_sql('book', engine, if_exists='replace', index = True) #Review this line, the index is just numerical.

211